app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:id])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `image_name`, `password_digest`) VALUES ('はるき', 'Haruki.Okuda0603@gmail.com', '2019-06-23 11:31:59', '2019-06-23 11:31:59', 'default_user.jpg', '$2a$10$27O90Sr1r7Pl.uPHzrxpKuOp5dH218bhNIe9DcXiumr/yPTiDMayW')
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpg",
      password: params[:password]
    )
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @user = User.find_by(id: params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def update
    @user = User.find_by(id: params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)